<a href="https://colab.research.google.com/github/CarlosLeandro09/DataAnalisysRadiology/blob/main/Um_pouco_de_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Basic stage**

**1.** Importações importantes para um estágio inicial

In [2]:
import pandas as pd
import numpy as np

**2.** Dados em uma escala temporal: **Séries**

In [3]:
series = pd.Series([np.nan, 0, 1, 2])
series

0    NaN
1    0.0
2    1.0
3    2.0
dtype: float64

**3.** Ainda relativo a séries, vamos "manipular" **datas**...

pd.date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs)

In [7]:
datas = pd.date_range("20200101",periods=4,freq="D")
datas

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04'], dtype='datetime64[ns]', freq='D')

**4.** Criação de **DataFrame**

In [13]:
df = pd.DataFrame(np.random.randn(4,4), index = datas, columns = list("ABCD"))
df

                   A         B         C         D
2020-01-01 -0.315967  1.206254  1.361349  0.280692
2020-01-02 -0.499006 -0.288771 -0.892038 -0.504584
2020-01-03  0.005865 -0.050910  1.916251 -0.895642
2020-01-04  0.001959 -1.682268 -0.794105  0.314212

In [25]:
df2 = pd.DataFrame({"A":7,
                    "B":pd.Series(1,index=list(range(5)),dtype="float32"),
                    "C":np.array([3]*5,dtype="int32"), 
                    "D":pd.Categorical(["Carro","Coelho","Caipora","Cigarro","Cinema"]),
                    "E":pd.Timestamp("20190204"),
                    "F":"Dragonball"})
df2

   A    B  C        D          E           F
0  7  1.0  3    Carro 2019-02-04  Dragonball
1  7  1.0  3   Coelho 2019-02-04  Dragonball
2  7  1.0  3  Caipora 2019-02-04  Dragonball
3  7  1.0  3  Cigarro 2019-02-04  Dragonball
4  7  1.0  3   Cinema 2019-02-04  Dragonball

In [33]:
df2.head(3)

   A    B  C        D          E           F   G  Soma
0  7  1.0  3    Carro 2019-02-04  Dragonball  RX    10
1  7  1.0  3   Coelho 2019-02-04  Dragonball  RX    10
2  7  1.0  3  Caipora 2019-02-04  Dragonball  RX    10

In [34]:
df2.tail(3)

   A    B  C        D          E           F   G  Soma
2  7  1.0  3  Caipora 2019-02-04  Dragonball  RX    10
3  7  1.0  3  Cigarro 2019-02-04  Dragonball  RX    10
4  7  1.0  3   Cinema 2019-02-04  Dragonball  RX    10

In [35]:
df2.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [36]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'Soma'], dtype='object')

In [39]:
#df --> Tira índices e colunas
df.to_numpy()

array([[-0.31596681,  1.20625397,  1.36134855,  0.28069225],
       [-0.49900598, -0.28877094, -0.89203772, -0.5045837 ],
       [ 0.00586543, -0.05090964,  1.91625086, -0.8956424 ],
       [ 0.00195941, -1.6822675 , -0.79410459,  0.31421248]])

In [41]:
df2.dtypes

A                int64
B              float32
C                int32
D             category
E       datetime64[ns]
F               object
G               object
Soma             int64
dtype: object

In [42]:
df2.shape

(5, 8)

**5.** Adição de **colunas** ao DataFrame

In [43]:
df2["G"] = pd.Series("RX",index=list(range(5)),dtype="str")
df2

   A    B  C        D          E           F   G  Soma
0  7  1.0  3    Carro 2019-02-04  Dragonball  RX    10
1  7  1.0  3   Coelho 2019-02-04  Dragonball  RX    10
2  7  1.0  3  Caipora 2019-02-04  Dragonball  RX    10
3  7  1.0  3  Cigarro 2019-02-04  Dragonball  RX    10
4  7  1.0  3   Cinema 2019-02-04  Dragonball  RX    10

**6.** **Operação** entre colunas

In [32]:
df2["Soma"] = df2["A"] + df2["C"]
df2

   A    B  C        D          E           F   G  Soma
0  7  1.0  3    Carro 2019-02-04  Dragonball  RX    10
1  7  1.0  3   Coelho 2019-02-04  Dragonball  RX    10
2  7  1.0  3  Caipora 2019-02-04  Dragonball  RX    10
3  7  1.0  3  Cigarro 2019-02-04  Dragonball  RX    10
4  7  1.0  3   Cinema 2019-02-04  Dragonball  RX    10

In [40]:
#Transposta
df2.T

                        0  ...                    4
A                       7  ...                    7
B                       1  ...                    1
C                       3  ...                    3
D                   Carro  ...               Cinema
E     2019-02-04 00:00:00  ...  2019-02-04 00:00:00
F              Dragonball  ...           Dragonball
G                      RX  ...                   RX
Soma                   10  ...                   10

[8 rows x 5 columns]